fuse-webinars/cxf-webinars/customer-ws-security-client/client.log

2011-04-01 08:48:11 DefaultListableBeanFactory [INFO] Pre-instantiating singletons in org.springframework.beans.factory.support.DefaultListableBeanFactory@21b38cdc: defining beans [cxf,org.apache.cxf.bus.spring.BusApplicationListener,org.apache.cxf.bus.spring.BusWiringBeanFactoryPostProcessor,org.apache.cxf.bus.spring.Jsr250BeanPostProcessor,org.apache.cxf.bus.spring.BusExtensionPostProcessor,org.apache.cxf.resource.ResourceManager,org.apache.cxf.configuration.Configurer,org.apache.cxf.binding.BindingFactoryManager,org.apache.cxf.transport.DestinationFactoryManager,org.apache.cxf.transport.ConduitInitiatorManager,org.apache.cxf.wsdl.WSDLManager,org.apache.cxf.phase.PhaseManager,org.apache.cxf.workqueue.WorkQueueManager,org.apache.cxf.buslifecycle.BusLifeCycleManager,org.apache.cxf.endpoint.ServerRegistry,org.apache.cxf.endpoint.ServerLifeCycleManager,org.apache.cxf.endpoint.ClientLifeCycleManager,org.apache.cxf.transports.http.QueryHandlerRegistry,org.apache.cxf.endpoint.EndpointResolverRegistry,org.apache.cxf.headers.HeaderManager,org.apache.cxf.catalog.OASISCatalogManager,org.apache.cxf.service.factory.FactoryBeanListenerManager,org.apache.cxf.endpoint.ServiceContractResolverRegistry,org.apache.cxf.ws.security.policy.WSSecurityPolicyLoader,org.apache.cxf.jaxws.context.WebServiceContextResourceResolver,org.apache.cxf.jaxws.context.WebServiceContextImpl,org.apache.cxf.binding.xml.XMLBindingFactory,org.apache.cxf.ws.addressing.policy.AddressingAssertionBuilder,org.apache.cxf.ws.addressing.policy.AddressingPolicyInterceptorProvider,org.apache.cxf.ws.addressing.policy.UsingAddressingAssertionBuilder,org.apache.cxf.transport.http.policy.HTTPClientAssertionBuilder,org.apache.cxf.transport.http.policy.HTTPServerAssertionBuilder,org.apache.cxf.transport.http.policy.NoOpPolicyInterceptorProvider,org.apache.cxf.transport.http.ClientOnlyHTTPTransportFactory,org.apache.cxf.binding.soap.SoapBindingFactory,org.apache.cxf.binding.soap.SoapTransportFactory,org.apache.cxf.binding.soap.customEditorConfigurer]; root of factory hierarchy
2011-04-01 08:48:13 PasswordCallback [INFO] Setting password for user Alice existing password is 'null'
2011-04-01 08:48:13 PasswordCallback [INFO] Setting password for user scott existing password is 'null'
2011-04-01 08:48:13 AbstractLoggingInterceptor [INFO] Outbound Message
---------------------------
ID: 1
Address: https://localhost:8443/cxf/Customers
Encoding: UTF-8
Content-Type: text/xml
Headers: {SOAPAction=["http://www.example.org/CustomerService/lookupCustomer"], Accept=[*/*]}
Payload: <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soap:mustUnderstand="1"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EncKeyId-1AF726F36BE9C5643913016404934885"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"></xenc:EncryptionMethod><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:X509Data>
<ds:X509IssuerSerial>
<ds:X509IssuerName>C=IE,ST=DU,O=fusesource.com,OU=CXF Webinar,CN=CA</ds:X509IssuerName>
<ds:X509SerialNumber>4933</ds:X509SerialNumber>
</ds:X509IssuerSerial>
</ds:X509Data></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>pK1U4kO7pOOJiGNFtKChThY9T/6zcKO3918MyZKCY/Cr6bnWcbwahDyoJMqKcn38DsFxhKieUPCrV3qFOqCdiZNZBmv3Jwo2U6Tkq814IrzG+pEPxt/SFPZr987kQlnw3KakgUnQG1EwmMc4vqOtb9RXi8UE2aBB6sOHnkxPC2Y=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#EncDataId-5"></xenc:DataReference><xenc:DataReference URI="#EncDataId-6"></xenc:DataReference></xenc:ReferenceList></xenc:EncryptedKey><wsse:BinarySecurityToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="CertId-1AF726F36BE9C5643913016404934201">MIICKzCCAZSgAwIBAgIETZTn2zANBgkqhkiG9w0BAQUFADBaMQswCQYDVQQGEwJJRTELMAkGA1UECBMCRFUxFzAVBgNVBAoTDmZ1c2Vzb3VyY2UuY29tMRUwEwYDVQQLEwxDWEYgV2ViaW5hcnMxDjAMBgNVBAMTBXNjb3R0MB4XDTExMDMzMTIwNDUxNVoXDTExMDYyOTIwNDUxNVowWjELMAkGA1UEBhMCSUUxCzAJBgNVBAgTAkRVMRcwFQYDVQQKEw5mdXNlc291cmNlLmNvbTEVMBMGA1UECxMMQ1hGIFdlYmluYXJzMQ4wDAYDVQQDEwVzY290dDCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAtUDM26EdbJoulRJHnohQRw38oFb0vNIXGLs5eEC+RAB/iU874LyulZWcrdftEcOzK8zn2rGAsa5Fe6F7amJ+zXO7OECjrvC9UbXw5cMSH+piDmmWlzB6KPvuL/eG5j+tWEPDKEgUQfvBsdb37TQJYN5YQGTh9dSRHUcZvNOMYu8CAwEAATANBgkqhkiG9w0BAQUFAAOBgQCRXXIMzOZi72idkpLWLRkyKi13CKwITWSSPqZiLwQRCQT6W2jC0IoWGn5vnAafA+I6eqSawU2NgNBlzJ7NASZeZoFx6ITuaNKwnMQJ1JRfdzgZ51iQJZn38fHyRZ/37jzYa4QpV2luVzQx1vLeduhuaixmgSaXIMTIMxINfcQ2PA==</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-3">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod>
<ds:Reference URI="#Timestamp-2">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
<ds:DigestValue>lSCI6pKXgndmnPLPduLazxP+h1c=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#id-4">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
<ds:DigestValue>p1YF2IB+Q8mFktsGZSTiEMbyjmc=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
MVYk/kQajNu8cKDa1yxiQlDL5oZn+At1nj7199iyZk3Wjytu13GX8VyDkPjzw1u7Kud07cEh2W3H
lWQwyHa4L60YthPigVFII4VdA7JsOjMKRtIRU0HMzCgYyuj3v2gxOw2/CxzEXC6D9bWBjoz4D+md
k52lwysxrq6UoNubUms=
</ds:SignatureValue>
<ds:KeyInfo Id="KeyId-1AF726F36BE9C5643913016404934272">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STRId-1AF726F36BE9C5643913016404934293"><wsse:Reference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" URI="#CertId-1AF726F36BE9C5643913016404934201" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"></wsse:Reference></wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EncDataId-5" Type="http://www.w3.org/2001/04/xmlenc#Element"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"></xenc:EncryptionMethod><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" URI="#EncKeyId-1AF726F36BE9C5643913016404934885"></wsse:Reference></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>K5Mo3NPNljS6d3HMg6WZ+UXQ29EgoZEAUne0w4KEprgLJkTJ7xiuR1yVttNIfH2934Kx/wyNhH+F
7Nb3emBXeIphuXKJdAkOY90Ssbc9dpJwMqv2f/n+S31i83AV+TfRoYkbCJL8xD+SbriNmAoF+kl/
Gvh+uoyqxIJYxiFdPvhPkv6SkueCHgepHYPMs1+xwLnWah0wXyMJCTVGqE/WRvKobgNIwInQId/R
vtYuaGEME8RwRW7+B5OggXmIJZ4/jz2CuBUAGbkxb1cfX4ZE7+/m98lBc8tDpw54/ozu+ArUpO4I
HVE36zOk/8fxolalFZQ3o61uTfH/nK7lDxLc806u7wY0xew42fZFoEsX1jjMkFVO165aKRyaeThW
so4x1khDj9qdLqGKmaEYPsyTfb03tZj8IyItBROha2rPLLa6DJwd1ioNf0oqfDtOAOKCo8y0R9CZ
hdthFNZ537IhRb+2LNj2n4pPRqTv4cZ9NbQL+WwpW6p62vtQ16QjZxsRxjf7IWFn3ZD8X3KT6nLA
L51Bzdf03wIpgmxXl/WGuBNDnzos5/Srh4njhX7EOWPVq5mKk/ekfpupI1AHrQQIBeLYSqj58lkr
daM4SyOfKQo=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData><wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="UsernameToken-1"><wsse:Username>Alice</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">ecilA</wsse:Password></wsse:UsernameToken></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-4"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EncDataId-6" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"></xenc:EncryptionMethod><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" URI="#EncKeyId-1AF726F36BE9C5643913016404934885"></wsse:Reference></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>OMY3YCBiB5eE5/YJLfjGtRcJPFJzSfM7TAxB1XCGeqksVxeMHVQK4n/y+KPLenSuECwAC99hpqEb
N+Q0fx9C6cRaJ4Qo/SvSHoi0TmN7HI6LVoC9b3u/tTJe9ER8GpYX6dMFhcFeMZMhWtpu8aqw54U7
Jdc2mzCe3XZWUDBCVYPiwQoUKBiTh1az9e45rBFkaFMQEEXAlwhjts0TmSrWM5jnlrZWFxEP+WIO
h/v8jggTKydARiZuaTQTAgtZcelj/kd8KhmmrrWwmW78X2Wldw==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body></soap:Envelope>
--------------------------------------
2011-04-01 08:53:00 DefaultListableBeanFactory [INFO] Pre-instantiating singletons in org.springframework.beans.factory.support.DefaultListableBeanFactory@738d56e: defining beans [cxf,org.apache.cxf.bus.spring.BusApplicationListener,org.apache.cxf.bus.spring.BusWiringBeanFactoryPostProcessor,org.apache.cxf.bus.spring.Jsr250BeanPostProcessor,org.apache.cxf.bus.spring.BusExtensionPostProcessor,org.apache.cxf.resource.ResourceManager,org.apache.cxf.configuration.Configurer,org.apache.cxf.binding.BindingFactoryManager,org.apache.cxf.transport.DestinationFactoryManager,org.apache.cxf.transport.ConduitInitiatorManager,org.apache.cxf.wsdl.WSDLManager,org.apache.cxf.phase.PhaseManager,org.apache.cxf.workqueue.WorkQueueManager,org.apache.cxf.buslifecycle.BusLifeCycleManager,org.apache.cxf.endpoint.ServerRegistry,org.apache.cxf.endpoint.ServerLifeCycleManager,org.apache.cxf.endpoint.ClientLifeCycleManager,org.apache.cxf.transports.http.QueryHandlerRegistry,org.apache.cxf.endpoint.EndpointResolverRegistry,org.apache.cxf.headers.HeaderManager,org.apache.cxf.catalog.OASISCatalogManager,org.apache.cxf.service.factory.FactoryBeanListenerManager,org.apache.cxf.endpoint.ServiceContractResolverRegistry,org.apache.cxf.ws.security.policy.WSSecurityPolicyLoader,org.apache.cxf.jaxws.context.WebServiceContextResourceResolver,org.apache.cxf.jaxws.context.WebServiceContextImpl,org.apache.cxf.binding.xml.XMLBindingFactory,org.apache.cxf.ws.addressing.policy.AddressingAssertionBuilder,org.apache.cxf.ws.addressing.policy.AddressingPolicyInterceptorProvider,org.apache.cxf.ws.addressing.policy.UsingAddressingAssertionBuilder,org.apache.cxf.transport.http.policy.HTTPClientAssertionBuilder,org.apache.cxf.transport.http.policy.HTTPServerAssertionBuilder,org.apache.cxf.transport.http.policy.NoOpPolicyInterceptorProvider,org.apache.cxf.transport.http.ClientOnlyHTTPTransportFactory,org.apache.cxf.binding.soap.SoapBindingFactory,org.apache.cxf.binding.soap.SoapTransportFactory,org.apache.cxf.binding.soap.customEditorConfigurer]; root of factory hierarchy
2011-04-01 08:53:02 PasswordCallback [INFO] Setting password for user Alice existing password is 'null'
2011-04-01 08:53:02 PasswordCallback [INFO] Setting password for user scott existing password is 'null'
2011-04-01 08:53:03 AbstractLoggingInterceptor [INFO] Outbound Message
---------------------------
ID: 1
Address: https://localhost:8443/cxf/Customers
Encoding: UTF-8
Content-Type: text/xml
Headers: {SOAPAction=["http://www.example.org/CustomerService/lookupCustomer"], Accept=[*/*]}
Payload: <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soap:mustUnderstand="1"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EncKeyId-4F3D189FCCB7702E8813016407830405"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"></xenc:EncryptionMethod><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:X509Data>
<ds:X509IssuerSerial>
<ds:X509IssuerName>C=IE,ST=DU,O=fusesource.com,OU=CXF Webinar,CN=CA</ds:X509IssuerName>
<ds:X509SerialNumber>4933</ds:X509SerialNumber>
</ds:X509IssuerSerial>
</ds:X509Data></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>YqYidbM57Dkyqb3AJWPICs/+lcxIN7sfp7uRMrha+Mt36k3zZjAqTnWtWFBFLrAjW8WNphkIOdMZ6wpx9Q0r/eUAid5bd6i9BfIVKnh3DFQLGDPrwXzLAgaw4oStkJyaTx9KTjIbH+S3thYWhy4h3dajAvi208fUbhNukWbvzPA=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#EncDataId-5"></xenc:DataReference><xenc:DataReference URI="#EncDataId-6"></xenc:DataReference></xenc:ReferenceList></xenc:EncryptedKey><wsse:BinarySecurityToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="CertId-4F3D189FCCB7702E8813016407829921">MIICKzCCAZSgAwIBAgIETZTn2zANBgkqhkiG9w0BAQUFADBaMQswCQYDVQQGEwJJRTELMAkGA1UECBMCRFUxFzAVBgNVBAoTDmZ1c2Vzb3VyY2UuY29tMRUwEwYDVQQLEwxDWEYgV2ViaW5hcnMxDjAMBgNVBAMTBXNjb3R0MB4XDTExMDMzMTIwNDUxNVoXDTExMDYyOTIwNDUxNVowWjELMAkGA1UEBhMCSUUxCzAJBgNVBAgTAkRVMRcwFQYDVQQKEw5mdXNlc291cmNlLmNvbTEVMBMGA1UECxMMQ1hGIFdlYmluYXJzMQ4wDAYDVQQDEwVzY290dDCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAtUDM26EdbJoulRJHnohQRw38oFb0vNIXGLs5eEC+RAB/iU874LyulZWcrdftEcOzK8zn2rGAsa5Fe6F7amJ+zXO7OECjrvC9UbXw5cMSH+piDmmWlzB6KPvuL/eG5j+tWEPDKEgUQfvBsdb37TQJYN5YQGTh9dSRHUcZvNOMYu8CAwEAATANBgkqhkiG9w0BAQUFAAOBgQCRXXIMzOZi72idkpLWLRkyKi13CKwITWSSPqZiLwQRCQT6W2jC0IoWGn5vnAafA+I6eqSawU2NgNBlzJ7NASZeZoFx6ITuaNKwnMQJ1JRfdzgZ51iQJZn38fHyRZ/37jzYa4QpV2luVzQx1vLeduhuaixmgSaXIMTIMxINfcQ2PA==</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-3">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod>
<ds:Reference URI="#Timestamp-2">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
<ds:DigestValue>7e1fQ/7gVkUtuvJb8JoV7ba76Rg=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#id-4">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
<ds:DigestValue>p1YF2IB+Q8mFktsGZSTiEMbyjmc=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
POlpyO1qBn2OCH0PG8r49WoxMM6y9JzRCifGQCsJKc2BIR8FTd81nUPSbziIJHDOKLhxs9Cz6qtw
Y0u5YRx/4q6lMwu420b7pqPWyKQefEERYjKG1+PWamAcB/KwNhQSIaIBw9ZUEcZmsu+3lndxAzHX
beMwK7nubJC3RjzSRwM=
</ds:SignatureValue>
<ds:KeyInfo Id="KeyId-4F3D189FCCB7702E8813016407829992">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STRId-4F3D189FCCB7702E8813016407830013"><wsse:Reference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" URI="#CertId-4F3D189FCCB7702E8813016407829921" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"></wsse:Reference></wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EncDataId-5" Type="http://www.w3.org/2001/04/xmlenc#Element"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"></xenc:EncryptionMethod><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" URI="#EncKeyId-4F3D189FCCB7702E8813016407830405"></wsse:Reference></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>05qVgSg2/y+HTFQxQZLELQCEvIAs/aI4B9BI2/q6QtVKETDiKeeNZ4KM19fUHvYBEkcwadaMIWIs
Dk9PzO2T75uI9/UhIsVGxmPBCY/7tu5XJ/qvIq85cfqsD2PFL3Nc5SfICCKRglyUqgfyURZpr9Zj
MdS3vTM99PintypFjQG1L0w5LGUFXYoH74UG6mvQ+Lr4tRXv46FDjlU+hTQJ3jXgW+3o4ozHkZQK
tLw04hHaywzfxKW2yLDGiVrWxo4XQZLqIUpg+8ZFq+AaWyH/5/1ksmN4wGovU3IZC5e2d1jrj07u
m1lnbnRuFk2tOL7XNSTTCtiV2RjeS6BEPwQXU6O3kdRf0gBRSZN3dhB3tjcKh4aTKeTTDk7PqcPk
SvzJZIANmaap0dg6uaewTi0Lr1GbrPQrntyUPdkddVeAujMYVJk1GiYEDrkKT6Ffb2lkVrKTvLYm
PCMxIkdgzxX2MK2CZGHZUs7MS898u7iVpNkbePSV7wv2EyDoohlYOMTnhjDcONCAvQCkNEofuR1C
+DTunFAvloXN4OHx9ZVCE2ZQlJfKiui6WCeAz55fqKQEE+ykWsT7JaIuMWOZE1rop0SlknhqFUJJ
oON82AVfx2g=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData><wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="UsernameToken-1"><wsse:Username>Alice</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">ecilA</wsse:Password></wsse:UsernameToken></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-4"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EncDataId-6" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"></xenc:EncryptionMethod><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" URI="#EncKeyId-4F3D189FCCB7702E8813016407830405"></wsse:Reference></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>Q0dJFYPwF3GFYsY2C6T0pR+dlEEcBm5qYChpFpTwf5a6UagvKgSinHGlZt74yVsExNHYs71C2E+d
7mfR5wjuzYP9K9RoW+kEUFkH3v6bF3AiImv0RYjDG0FCdnx4E9PmXGgoZ/txg6B8hIiXdVzlXc8m
MiDjNLeSbjrlJWRvWLUGOLM98A/WgvP7XaSpoOyiVUutWCXESKDYOZp0l0Y+NtaEn+9jGq+naFPW
3hD3i7eyGVJic5Pq8nGDt5N0VFPvS4GmZjPfiMqG2443HDW2rw==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body></soap:Envelope>
--------------------------------------
